chenyurong22/STM32-EC200-Firmware/src/modem.c
/* set false when PDP_OPEN is entered; set true when AT+QICSGP is sent from
 * Modem_Process (after the RX buffer is drained) so we never mistake the
 * trailing OK of AT+CGREG? for QICSGP's OK.                                */
static bool qicsgp_sent = false;

/* set false when PDP_ACTIVATE is entered; set true when AT+QIACT=1 is sent
 * from Modem_Process (after the RX buffer is drained) so we never mistake
 * stale OK responses from AT+QMTCLOSE/AT+QIDEACT for QIACT's OK.          */
static bool qiact_sent = false;

/* set true on first AT+QIACT=1 ERROR so the handler force-deactivates and
 * retries once before falling back to NET_WAIT.  Reset on PDP_ACTIVATE entry
 * and on success.  Fixes the post-OTA loop: QIDEACT may silently fail in
 * Modem_Init if HTTP is still closing, leaving the PDP context active.
 * EC200U returns ERROR (not OK) when AT+QIACT=1 is sent on an already-active
 * context, which previously caused an infinite NET_WAIT/PDP loop.           */
static bool qiact_retry_done = false;

/* set true when +QMTOPEN: 0,"hostname",port URC arrives (TLS handshake
 * started).  Success fires only on the subsequent OK (TLS complete).     */
static bool qmtopen_tls_seen = false;
/* Set when unsolicited modem reboot URCs are seen (RDY/+CFUN: 1) so
 * Modem_Process can run a full Modem_Init() re-initialization. */
static bool modem_reinit_pending = false;

static bool ota_retry_blocked(void)
{
    return ((int32_t)(HAL_GetTick() - ota_retry_block_until) < 0);
}

static void modem_log_reset_flags(uint32_t csr)
{
    char flags[128];
    flags[0] = '\0';
#ifdef RCC_CSR_LPWRRSTF
    if (csr & RCC_CSR_LPWRRSTF) strcat(flags, " LPWR");
#endif
#ifdef RCC_CSR_WWDGRSTF
    if (csr & RCC_CSR_WWDGRSTF) strcat(flags, " WWDG");
#endif
#ifdef RCC_CSR_IWDGRSTF
    if (csr & RCC_CSR_IWDGRSTF) strcat(flags, " IWDG");
#endif
#ifdef RCC_CSR_SFTRSTF
    if (csr & RCC_CSR_SFTRSTF) strcat(flags, " SFTRST");
#endif
#ifdef RCC_CSR_PORRSTF
    if (csr & RCC_CSR_PORRSTF) strcat(flags, " POR");
#endif
#ifdef RCC_CSR_PINRSTF
    if (csr & RCC_CSR_PINRSTF) strcat(flags, " PIN");
#endif
#ifdef RCC_CSR_BORRSTF
    if (csr & RCC_CSR_BORRSTF) strcat(flags, " BOR");
#endif
    if (flags[0] == '\0') strcpy(flags, " <none>");
    {
        char dbg[160];
        snprintf(dbg, sizeof(dbg), "[MODEM] Reset flags:%s\r\n", flags);
        Debug_Print(dbg);
    }
}


/* ═══════════════════════════════════════════════════════════════════════════
 * Low-level UART helpers
 * ═══════════════════════════════════════════════════════════════════════════ */

void Modem_Send(const char *cmd)
{
    if (!modem_uart || !cmd)
        return;
    HAL_UART_Transmit(modem_uart, (const uint8_t *)cmd, strlen(cmd), 2000);
}

static void modem_cmd(const char *cmd)
{
    Modem_Send(cmd);
    Modem_Send("\r\n");
}

/* ═══════════════════════════════════════════════════════════════════════════
 * Diagnostic blink  — N × 80 ms pulses on Relay1 (PA5), saves & restores.
 * Used to indicate MQTT progress without needing a UART adapter.
 *   blink_n(1) = QMTOPEN TCP connected (sent AT+QMTCONN)
 *   blink_n(2) = publish confirmed (broker ACK / OK received)
 *   blink_n(3) = MQTT fully connected (subscribed)  ← SUCCESS
 *   blink_n(4) = AT+QMTPUBEX command sent (publish attempted)
 *   blink_n(5) = QMTCONN REFUSED  ← wrong credentials / broker rejected
 *   blink_n(6) = QMTCONN ERROR    ← AT command layer error
 *   blink_n(7) = server dropped connection (+QMTSTAT received)
 * ═══════════════════════════════════════════════════════════════════════════ */

/* ═══════════════════════════════════════════════════════════════════════════
 * Relay control
 * ═══════════════════════════════════════════════════════════════════════════ */

/* Latching relay via transistor (HIGH = transistor ON = coil energised):
 *   Pump1: PA1 → SET coil, PB3 → RESET coil
 *   Pump2: PB4 → SET coil, PB5 → RESET coil
 * Pulse HIGH 200 ms to latch; relay holds position without power */

void Relay1_Set(bool on)
{
    relay1 = on;
    if (on) {
        HAL_GPIO_WritePin(Relay_Pin_GPIO_Port,  Relay_Pin_Pin,  GPIO_PIN_SET);   /* PB3 HIGH — SET coil pulse start  */
        HAL_Delay(200);
        HAL_GPIO_WritePin(Relay_Pin_GPIO_Port,  Relay_Pin_Pin,  GPIO_PIN_RESET); /* PB3 LOW  — SET coil pulse end    */
    } else {
        HAL_GPIO_WritePin(Relay1_RST_GPIO_Port, Relay1_RST_Pin, GPIO_PIN_SET);   /* PA1 HIGH — RESET coil pulse start */
        HAL_Delay(200);
        HAL_GPIO_WritePin(Relay1_RST_GPIO_Port, Relay1_RST_Pin, GPIO_PIN_RESET); /* PA1 LOW  — RESET coil pulse end   */
    }
}

void Relay2_Set(bool on)
{
    relay2 = on;
    if (on) {
        HAL_GPIO_WritePin(Relay2_Pin_GPIO_Port, Relay2_Pin_Pin, GPIO_PIN_SET);   /* PB4 HIGH — SET coil pulse start  */
        HAL_Delay(200);
        HAL_GPIO_WritePin(Relay2_Pin_GPIO_Port, Relay2_Pin_Pin, GPIO_PIN_RESET); /* PB4 LOW  — SET coil pulse end    */
    } else {
        HAL_GPIO_WritePin(Relay2_RST_GPIO_Port, Relay2_RST_Pin, GPIO_PIN_SET);   /* PB5 HIGH — RESET coil pulse start */
        HAL_Delay(200);
        HAL_GPIO_WritePin(Relay2_RST_GPIO_Port, Relay2_RST_Pin, GPIO_PIN_RESET); /* PB5 LOW  — RESET coil pulse end   */
    }
}

static void blink_n(int n)
{
    /* PA1 is now RESET coil — cannot use for diagnostic blink (would unlatch relay) */
    (void)n;
}

/* ═══════════════════════════════════════════════════════════════════════════
 * Connection status
 * ═══════════════════════════════════════════════════════════════════════════ */

bool Modem_IsConnected(void)
{
    return mqtt_state == MQTT_STATE_CONNECTED;
}

bool Relay1_Get(void) { return relay1; }
bool Relay2_Get(void) { return relay2; }

/* ═══════════════════════════════════════════════════════════════════════════
 * Sensor stubs
 * Override these in a separate sensors.c once you wire up ADC channels.
 * Until then they return safe dummy values so the MQTT loop works.
 * ═══════════════════════════════════════════════════════════════════════════ */

__attribute__((weak)) float Sensor_ReadVoltagePhase1(void) { return 415.0f; }
__attribute__((weak)) float Sensor_ReadVoltagePhase2(void) { return 415.0f; }
__attribute__((weak)) float Sensor_ReadVoltagePhase3(void) { return 415.0f; }
__attribute__((weak)) float Sensor_ReadCurrentACS712(void) { return 5.0f; }

/* ═══════════════════════════════════════════════════════════════════════════
 * MQTT publish helpers
 * ═══════════════════════════════════════════════════════════════════════════ */

