chenyurong22/STM32-EC200-Firmware/src/modem.c
static bool extract_str(const char *json, const char *key, char *out, size_t max)
{
    char search[40];
    snprintf(search, sizeof(search), "\"%s\":\"", key);
    const char *p = strstr(json, search);
    if (!p) return false;
    p += strlen(search);
    size_t i = 0;
    while (*p && *p != '"' && i < max - 1)
        out[i++] = *p++;
    out[i] = '\0';
    return (i > 0);
}

/* Accept OTA trigger payloads in either format:
 *   {"url":"https://..."}   or   https://...
 * Extract URL from any line containing http/https text. */
static bool extract_ota_url_any(const char *text, char *out, size_t max)
{
    const char *p = strstr(text, "https://");
    if (!p) p = strstr(text, "http://");
    if (!p) return false;

    size_t i = 0;
    while (*p && i < max - 1) {
        char c = *p;
        if (c == '"' || c == ',' || c == ' ' || c == '\r' || c == '\n')
            break;
        out[i++] = c;
        p++;
    }
    out[i] = '\0';
    return (i > 0);
}

static void modem_ota_start(const char *url); /* forward declaration */
static void modem_ota_publish(const char *topic, const char *payload); /* forward declaration */
static bool modem_is_exact_reboot_urc(const char *line);

/* ── Relay state persistence (Flash page 31 = 0x0800F800, 2KB) ──────────────
 * Saves relay1/relay2 ON/OFF state so a power-cycle reboot restores the
 * physical latching-relay position correctly instead of defaulting to OFF. */
#define RELAY_STATE_MAGIC  0xFEED5A5CU  /* bumped: struct now includes run_accum */
#define RELAY_STATE_ADDR   0x0800F800U
#define RELAY_STATE_PAGE   31U

typedef struct {
    uint32_t magic;
    uint32_t relay1;         /* 1 = ON, 0 = OFF */
    uint32_t relay2;
    uint32_t run_accum1_ms;  /* saved running time relay1 — restored on power-on */
    uint32_t run_accum2_ms;  /* saved running time relay2 — restored on power-on */
    uint32_t _pad;           /* 24 bytes total — 3 doublewords */
} RelayState_t;

static void RelayState_Save(void)
{
    RelayState_t s;
    s.magic         = RELAY_STATE_MAGIC;
    s.relay1        = relay1 ? 1U : 0U;
    s.relay2        = relay2 ? 1U : 0U;
    s.run_accum1_ms = run_accum1_ms;
    s.run_accum2_ms = run_accum2_ms;
    s._pad          = 0U;

    HAL_FLASH_Unlock();
    FLASH_EraseInitTypeDef erase = {
        .TypeErase = FLASH_TYPEERASE_PAGES,
        .Page      = RELAY_STATE_PAGE,
        .NbPages   = 1,
    };
    uint32_t page_err = 0;
    HAL_FLASHEx_Erase(&erase, &page_err);

    uint64_t buf[3];
    memcpy(buf, &s, sizeof(s));
    HAL_FLASH_Program(FLASH_TYPEPROGRAM_DOUBLEWORD, RELAY_STATE_ADDR,        buf[0]);
    HAL_FLASH_Program(FLASH_TYPEPROGRAM_DOUBLEWORD, RELAY_STATE_ADDR + 8U,   buf[1]);
    HAL_FLASH_Program(FLASH_TYPEPROGRAM_DOUBLEWORD, RELAY_STATE_ADDR + 16U,  buf[2]);
    HAL_FLASH_Lock();
    Debug_Print("[CFG] Relay state saved to Flash\r\n");
}

static void RelayState_Load(void)
{
    const RelayState_t *p = (const RelayState_t *)RELAY_STATE_ADDR;
    if (p->magic != RELAY_STATE_MAGIC) {
        Debug_Print("[CFG] No saved relay state — defaulting OFF\r\n");
        /* Bistable relays hold position through power-loss.
         * Explicitly reset both so contacts match the expected default. */
        Relay1_Set(false);
        Relay2_Set(false);
        return;
    }
    bool r1 = p->relay1 ? true : false;
    bool r2 = (p->relay2 && !r1) ? true : false;  /* interlock: relay2 OFF if relay1 ON */

    /* Restore accumulated run time — only meaningful if relay was ON when saved */
    if (r1) run_accum1_ms = p->run_accum1_ms;
    if (r2) run_accum2_ms = p->run_accum2_ms;

    /* Step 1: RESET both relays to a known OFF state first.
     * Bistable relays hold their mechanical position through power-loss so
     * the physical state on boot is unknown.  Resetting both guarantees a
     * clean starting point before re-applying the saved state. */
    Relay1_Set(false);
    Relay2_Set(false);

    /* Step 2: wait 500 ms before re-energising.
     * On a watchdog/software reboot the motor contactor may still be closed
     * and the motor shaft still spinning.  The delay allows the contactor
     * to fully open and the motor to coast down before the SET pulse is
     * sent, avoiding inrush current and mechanical stress on re-close. */
    HAL_Delay(500);

    /* Step 3: restore saved state — SET whichever relay was ON. */
    if (r1) Relay1_Set(true);
    if (r2) Relay2_Set(true);
    Debug_Print("[CFG] Relay state restored from Flash\r\n");
}

/* Apply protection settings from JSON payload */
static void apply_settings(const char *json)
{
    float v;
    int   t;
    v = extract_float(json, "ov",    cfg_ov);    if (v > 0.0f) cfg_ov    = v;
    v = extract_float(json, "uv",    cfg_uv);    if (v > 0.0f) cfg_uv    = v;
    v = extract_float(json, "pl",    cfg_pl);    if (v > 0.0f) cfg_pl    = v;
    v = extract_float(json, "dry_i", cfg_dry_i); if (v > 0.0f) cfg_dry_i = v;
    t = extract_int(json, "dry_t");              if (t > 0)    cfg_dry_t = t;
    t = extract_int(json, "hp");                 if (t > 0)    cfg_hp     = t;
    if (strstr(json, "\"dry_en\":"))             cfg_dry_en = extract_int(json, "dry_en") ? 1 : 0;
    t = extract_int(json, "start_t");            if (t > 0)    cfg_start_t = t;
    Debug_Print("[CFG] Settings updated\r\n");
    publish_status(); /* reflect new cfg_ values immediately — don't wait for next heartbeat */
}

/* Apply relay2-specific settings (dry_i/dry_t/dry_en/hp only — voltage shared) */
static void apply_settings2(const char *json)
{
    float v;
    int   t;
    v = extract_float(json, "dry_i", cfg_dry_i2); if (v > 0.0f) cfg_dry_i2 = v;
    t = extract_int(json, "dry_t");               if (t > 0)    cfg_dry_t2 = t;
    t = extract_int(json, "hp");                  if (t > 0)    cfg_hp2    = t;
    if (strstr(json, "\"dry_en\":"))              cfg_dry_en2 = extract_int(json, "dry_en") ? 1 : 0;
    t = extract_int(json, "start_t");             if (t > 0)    cfg_start_t2 = t;
    Debug_Print("[CFG] Settings2 updated\r\n");
    publish_status(); /* cfg_dry_en2 is in pump01 status — publish immediately */
}

/* ═══════════════════════════════════════════════════════════════════════════
 * Line processor — called for every complete line received from EC200U
 * ═══════════════════════════════════════════════════════════════════════════ */

